MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG330F1024/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFM32GG330F1024_Part */

/***************************************************************************//**
 * @defgroup EFM32GG330F1024_Peripheral_TypeDefs EFM32GG330F1024 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32gg_dma_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG330F1024_DMA EFM32GG330F1024 DMA
 * @{
 * @brief EFM32GG330F1024_DMA Register Declaration
 ******************************************************************************/
typedef struct {
  __IM uint32_t  STATUS;          /**< DMA Status Registers  */
  __OM uint32_t  CONFIG;          /**< DMA Configuration Register  */
  __IOM uint32_t CTRLBASE;        /**< Channel Control Data Base Pointer Register  */
  __IM uint32_t  ALTCTRLBASE;     /**< Channel Alternate Control Data Base Pointer Register  */
  __IM uint32_t  CHWAITSTATUS;    /**< Channel Wait on Request Status Register  */
  __OM uint32_t  CHSWREQ;         /**< Channel Software Request Register  */
  __IOM uint32_t CHUSEBURSTS;     /**< Channel Useburst Set Register  */
  __OM uint32_t  CHUSEBURSTC;     /**< Channel Useburst Clear Register  */
  __IOM uint32_t CHREQMASKS;      /**< Channel Request Mask Set Register  */
  __OM uint32_t  CHREQMASKC;      /**< Channel Request Mask Clear Register  */
  __IOM uint32_t CHENS;           /**< Channel Enable Set Register  */
  __OM uint32_t  CHENC;           /**< Channel Enable Clear Register  */
  __IOM uint32_t CHALTS;          /**< Channel Alternate Set Register  */
  __OM uint32_t  CHALTC;          /**< Channel Alternate Clear Register  */
  __IOM uint32_t CHPRIS;          /**< Channel Priority Set Register  */
  __OM uint32_t  CHPRIC;          /**< Channel Priority Clear Register  */
  uint32_t       RESERVED0[3U];   /**< Reserved for future use **/
  __IOM uint32_t ERRORC;          /**< Bus Error Clear Register  */

  uint32_t       RESERVED1[880U]; /**< Reserved for future use **/
  __IM uint32_t  CHREQSTATUS;     /**< Channel Request Status  */
  uint32_t       RESERVED2[1U];   /**< Reserved for future use **/
  __IM uint32_t  CHSREQSTATUS;    /**< Channel Single Request Status  */

  uint32_t       RESERVED3[121U]; /**< Reserved for future use **/
  __IM uint32_t  IF;              /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;             /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;             /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;             /**< Interrupt Enable register  */
  __IOM uint32_t CTRL;            /**< DMA Control Register  */
  __IOM uint32_t RDS;             /**< DMA Retain Descriptor State  */

  uint32_t       RESERVED4[2U];   /**< Reserved for future use **/
  __IOM uint32_t LOOP0;           /**< Channel 0 Loop Register  */
  __IOM uint32_t LOOP1;           /**< Channel 1 Loop Register  */
  uint32_t       RESERVED5[14U];  /**< Reserved for future use **/
  __IOM uint32_t RECT0;           /**< Channel 0 Rectangle Register  */

  uint32_t       RESERVED6[39U];  /**< Reserved registers */
  DMA_CH_TypeDef CH[12U];         /**< Channel registers */
} DMA_TypeDef;                    /**< DMA Register Declaration *//** @} */

// #include "efm32gg_aes.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_usb_hc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_usb.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_rmu.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG330F1024_CMU EFM32GG330F1024 CMU
 * @{
 * @brief EFM32GG330F1024_CMU Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t CTRL;          /**< CMU Control Register  */
  __IOM uint32_t HFCORECLKDIV;  /**< High Frequency Core Clock Division Register  */
  __IOM uint32_t HFPERCLKDIV;   /**< High Frequency Peripheral Clock Division Register  */
  __IOM uint32_t HFRCOCTRL;     /**< HFRCO Control Register  */
  __IOM uint32_t LFRCOCTRL;     /**< LFRCO Control Register  */
  __IOM uint32_t AUXHFRCOCTRL;  /**< AUXHFRCO Control Register  */
  __IOM uint32_t CALCTRL;       /**< Calibration Control Register  */
  __IOM uint32_t CALCNT;        /**< Calibration Counter Register  */
  __IOM uint32_t OSCENCMD;      /**< Oscillator Enable/Disable Command Register  */
  __IOM uint32_t CMD;           /**< Command Register  */
  __IOM uint32_t LFCLKSEL;      /**< Low Frequency Clock Select Register  */
  __IM uint32_t  STATUS;        /**< Status Register  */
  __IM uint32_t  IF;            /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;           /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;           /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;           /**< Interrupt Enable Register  */
  __IOM uint32_t HFCORECLKEN0;  /**< High Frequency Core Clock Enable Register 0  */
  __IOM uint32_t HFPERCLKEN0;   /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t       RESERVED0[2U]; /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;      /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;        /**< Freeze Register  */
  __IOM uint32_t LFACLKEN0;     /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t       RESERVED1[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFBCLKEN0;     /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */

  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFAPRESC0;     /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t       RESERVED3[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFBPRESC0;     /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t       RESERVED4[1U]; /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;      /**< PCNT Control Register  */

  uint32_t       RESERVED5[1U]; /**< Reserved for future use **/
  __IOM uint32_t ROUTE;         /**< I/O Routing Register  */
  __IOM uint32_t LOCK;          /**< Configuration Lock Register  */
} CMU_TypeDef;                  /**< CMU Register Declaration *//** @} */

// #include "efm32gg_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG330F1024_PRS EFM32GG330F1024 PRS
 * @{
 * @brief EFM32GG330F1024_PRS Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTE;         /**< I/O Routing Register  */

  uint32_t       RESERVED0[1U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[12U];       /**< Channel registers */
} PRS_TypeDef;                  /**< PRS Register Declaration *//** @} */

// #include "efm32gg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_dac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_burtc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_burtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_etm.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_calibrate.h"  // Note: Changed for MikroE implementation.

